testcase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.25 0 0);

boundaryField
{
    top
    {
        type            slip;
    }
    in
    {
        type            freestream;
        freestreamValue $internalField;
        value           $internalField;
    }
    out
    {
        type            freestream;
        freestreamValue $internalField;
        value           $internalField;
    }
    bottom_symW
    {
        type            slip;
    }
    bottom_pillar
    {
        //type slip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    channel
    {
        type            slip;
    }
}


// ************************************************************************* //
