testcase/0/cellDist
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      cellDist;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
192000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 0;
    }
    in
    {
        type            calculated;
        value           uniform 0;
    }
    out
    {
        type            calculated;
        value           uniform 0;
    }
    bottom_symW
    {
        type            calculated;
        value           uniform 0;
    }
    bottom_pillar
    {
        type            calculated;
        value           uniform 0;
    }
    channel
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
