testcase/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.5 -0.125 0)
    (-0.15 -0.125 0)
    (-0.15 0.125 0)
    (-0.5  0.125 0)
    
    (-0.5 -0.125 0.265)
    (-0.15 -0.125 0.265)
    (-0.15 0.125 0.265)
    (-0.5  0.125 0.265)
    
    (0.15 -0.125 0)
    (0.15 0.125 0)
    (0.15 -0.125 0.265)
    (0.15 0.125 0.265)
    
    (1 -0.125 0)
    (1 0.125 0)
    (1 -0.125 0.265)
    (1 0.125 0.265)



    


);

blocks
(

    hex (0 1 2 3 4 5 6 7) (40 40 40) simpleGrading (0.5 1.05 1)
    hex ( 1 8 9 2 5 10 11 6  ) (40 40 40) simpleGrading (1 1.05 1)
    hex ( 8 12 13 9 10 14 15 11  ) (40 40 40) simpleGrading (1.4 1.05 1)

);

edges
(
);

boundary
(
    top
    {
        type wall;
        faces
        (
        	(4 5 6 7)
        	( 5 10 11 6 )
        	(10 14 15 11)      	
        );
    }
    in
    {
        type patch;
        faces
        (
            (4 7 3 0)
        );
    }

    out
    {
        type patch;
        faces
        (
			( 12 13 15 14 )
        );
    }

    bottom_symW
    {
        type wall;
        faces
        (
			( 3 2 1 0 )
			( 9 13 12 8 )
        );
    }
    
    bottom_pillar
    {
        type wall;
        faces
        (
			( 1 2 9 8 )
        );
    }
    
    channel
    {
		type 	wall;
        faces
        (          
		    (6 2 3 7)   
		    (6 11 9 2)  
		    (9 11 15 13)
		    (1 5 4 0)
		    (8 10 5 1)
		    (8 12 14 10)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //
